; domain
(define
	(domain wieze-hanoi)
	(:requirements :adl)
	(:types krazek palik)
	(:predicates
		(on-top ?x ?y - krazek)
		(clear ?k - krazek)
		(on-floor ?k - krazek)
		(wiekszy ?x ?y - krazek)
		(pusty ?x - palik)
		(krazek-na-paliku ?k - krazek ?x - palik)
	)
; krazek lezy nainnym, przesuwamy na pusty palik
	(:action przesun-na-pusty
		:parameters (?x ?y - palik ?k ?kk - krazek)
		:precondition
		(and
			(clear ?k)
			(pusty ?y)
			(on-top ?k ?kk)
			(krazek-na-paliku ?k ?x)
		)
		:effect
		(and
			(krazek-na-paliku ?k ?y)
			(not (krazek-na-paliku ?k ?x))
			(not (on-top ?k ?kk))
			(clear ?kk)
			(on-floor ?k)
			(not (pusty ?y))
		)
	)
; krazek lezy naziemi, przesuwamy go na pusty palik
	(:action przesun-ostatni-na-pusty
		:parameters (?x ?y - palik ?k - krazek)
		:precondition
		(and
			(clear ?k)
			(pusty ?y)
			(on-floor ?k)
			(krazek-na-paliku ?k ?x)
		)
		:effect
		(and
			(krazek-na-paliku ?k ?y)
			(not (krazek-na-paliku ?k ?x))
			(pusty ?x)
			(on-floor ?k)
			(not (pusty ?y))
		)
	)
; krazek lezy na innym, przesuwamy go na inny krazek na innym paliku
	(:action przesun
		:parameters (?x ?y - palik ?k ?kk ?g - krazek)
		:precondition
		(and
			(clear ?k)
			(on-top ?k ?kk)
			(clear ?g)
			(krazek-na-paliku ?k ?x)
			(krazek-na-paliku ?g ?y)
			(wiekszy ?g ?k)
			(not (pusty ?y))
		)
		:effect
		(and
			(not (clear ?g))
			(on-top ?k ?g)
			(not (on-top ?k ?kk))
			(clear ?kk)
			(krazek-na-paliku ?k ?y)
			(not (krazek-na-paliku ?k ?x))
		)
	)
; krazek lezy na ziemi, przesuwamy go na inny krazek na innym paliku
	(:action przesun_ostatni
		:parameters (?x ?y - palik ?k ?g - krazek)
		:precondition
		(and
			(clear ?k)
			(on-floor ?k)
			(clear ?g)
			(krazek-na-paliku ?k ?x)
			(krazek-na-paliku ?g ?y)
			(wiekszy ?g ?k)
			(not (pusty ?y))
		)
		:effect
		(and
			(not (clear ?g))
			(on-top ?k ?g)
			(not (on-floor ?k))
			(krazek-na-paliku ?k ?y)
			(not (krazek-na-paliku ?k ?x))
			(pusty ?x)
		)
	)
)

; problem
(define (problem p1)
	(:domain wieze-hanoi)
	(:objects k1 k2 k3 k4 k5 - krazek
				x y z - palik)
	(:init
		(clear k1)
		(on-top k1 k2)
		(on-top k2 k3)
		(on-top k3 k4)
		(on-top k4 k5)
		(on-floor k5)
		(wiekszy k2 k1)
		(wiekszy k3 k1)
		(wiekszy k4 k1)
		(wiekszy k5 k1)
		(wiekszy k3 k2)
		(wiekszy k4 k2)
		(wiekszy k5 k2)
		(wiekszy k4 k3)
		(wiekszy k5 k3)
		(wiekszy k5 k4)
		(pusty y)
		(pusty z)
		(krazek-na-paliku k1 x)
		(krazek-na-paliku k2 x)
		(krazek-na-paliku k3 x)
		(krazek-na-paliku k4 x)
		(krazek-na-paliku k5 x)
	)
	(:goal 
		(and
			(krazek-na-paliku k1 z)
			(krazek-na-paliku k2 z)
			(krazek-na-paliku k3 z)
			(krazek-na-paliku k4 z)
			(krazek-na-paliku k5 z)
		)
	)
)

; plan
1. (przesun-na-pusty x z k1 k2)
   deleted: (krazek-na-paliku k1 x) (on-top k1 k2) (pusty z)
   added: (krazek-na-paliku k1 z) (clear k2) (on-floor k1)
   goals met: 1 of 5
2. (przesun-na-pusty x y k2 k3)
   deleted: (krazek-na-paliku k2 x) (on-top k2 k3) (pusty y)
   added: (krazek-na-paliku k2 y) (clear k3) (on-floor k2)
   goals met: 1 of 5
3. (przesun_ostatni z y k1 k2)
   deleted: (clear k2) (on-floor k1) (krazek-na-paliku k1 z)
   added: (on-top k1 k2) (krazek-na-paliku k1 y) (pusty z)
   goals met: 0 of 5
4. (przesun-na-pusty x z k3 k4)
   deleted: (krazek-na-paliku k3 x) (on-top k3 k4) (pusty z)
   added: (krazek-na-paliku k3 z) (clear k4) (on-floor k3)
   goals met: 1 of 5
5. (przesun y x k1 k2 k4)
   deleted: (clear k4) (on-top k1 k2) (krazek-na-paliku k1 y)
   added: (on-top k1 k4) (clear k2) (krazek-na-paliku k1 x)
   goals met: 1 of 5
6. (przesun_ostatni y z k2 k3)
   deleted: (clear k3) (on-floor k2) (krazek-na-paliku k2 y)
   added: (on-top k2 k3) (krazek-na-paliku k2 z) (pusty y)
   goals met: 2 of 5
7. (przesun x z k1 k4 k2)
   deleted: (clear k2) (on-top k1 k4) (krazek-na-paliku k1 x)
   added: (on-top k1 k2) (clear k4) (krazek-na-paliku k1 z)
   goals met: 3 of 5
8. (przesun-na-pusty x y k4 k5)
   deleted: (krazek-na-paliku k4 x) (on-top k4 k5) (pusty y)
   added: (krazek-na-paliku k4 y) (clear k5) (on-floor k4)
   goals met: 3 of 5
9. (przesun z y k1 k2 k4)
   deleted: (clear k4) (on-top k1 k2) (krazek-na-paliku k1 z)
   added: (on-top k1 k4) (clear k2) (krazek-na-paliku k1 y)
   goals met: 2 of 5
10. (przesun z x k2 k3 k5)
   deleted: (clear k5) (on-top k2 k3) (krazek-na-paliku k2 z)
   added: (on-top k2 k5) (clear k3) (krazek-na-paliku k2 x)
   goals met: 1 of 5
11. (przesun y x k1 k4 k2)
   deleted: (clear k2) (on-top k1 k4) (krazek-na-paliku k1 y)
   added: (on-top k1 k2) (clear k4) (krazek-na-paliku k1 x)
   goals met: 1 of 5
12. (przesun_ostatni z y k3 k4)
   deleted: (clear k4) (on-floor k3) (krazek-na-paliku k3 z)
   added: (on-top k3 k4) (krazek-na-paliku k3 y) (pusty z)
   goals met: 0 of 5
13. (przesun-na-pusty x z k1 k2)
   deleted: (krazek-na-paliku k1 x) (on-top k1 k2) (pusty z)
   added: (krazek-na-paliku k1 z) (clear k2) (on-floor k1)
   goals met: 1 of 5
14. (przesun x y k2 k5 k3)
   deleted: (clear k3) (on-top k2 k5) (krazek-na-paliku k2 x)
   added: (on-top k2 k3) (clear k5) (krazek-na-paliku k2 y)
   goals met: 1 of 5
15. (przesun_ostatni z y k1 k2)
   deleted: (clear k2) (on-floor k1) (krazek-na-paliku k1 z)
   added: (on-top k1 k2) (krazek-na-paliku k1 y) (pusty z)
   goals met: 0 of 5
16. (przesun-ostatni-na-pusty x z k5)
   deleted: (krazek-na-paliku k5 x) (pusty z)
   added: (krazek-na-paliku k5 z) (pusty x)
   goals met: 1 of 5
17. (przesun-na-pusty y x k1 k2)
   deleted: (krazek-na-paliku k1 y) (on-top k1 k2) (pusty x)
   added: (krazek-na-paliku k1 x) (clear k2) (on-floor k1)
   goals met: 1 of 5
18. (przesun y z k2 k3 k5)
   deleted: (clear k5) (on-top k2 k3) (krazek-na-paliku k2 y)
   added: (on-top k2 k5) (clear k3) (krazek-na-paliku k2 z)
   goals met: 2 of 5
19. (przesun_ostatni x z k1 k2)
   deleted: (clear k2) (on-floor k1) (krazek-na-paliku k1 x)
   added: (on-top k1 k2) (krazek-na-paliku k1 z) (pusty x)
   goals met: 3 of 5
20. (przesun-na-pusty y x k3 k4)
   deleted: (krazek-na-paliku k3 y) (on-top k3 k4) (pusty x)
   added: (krazek-na-paliku k3 x) (clear k4) (on-floor k3)
   goals met: 3 of 5
21. (przesun z y k1 k2 k4)
   deleted: (clear k4) (on-top k1 k2) (krazek-na-paliku k1 z)
   added: (on-top k1 k4) (clear k2) (krazek-na-paliku k1 y)
   goals met: 2 of 5
22. (przesun z x k2 k5 k3)
   deleted: (clear k3) (on-top k2 k5) (krazek-na-paliku k2 z)
   added: (on-top k2 k3) (clear k5) (krazek-na-paliku k2 x)
   goals met: 1 of 5
23. (przesun y x k1 k4 k2)
   deleted: (clear k2) (on-top k1 k4) (krazek-na-paliku k1 y)
   added: (on-top k1 k2) (clear k4) (krazek-na-paliku k1 x)
   goals met: 1 of 5
24. (przesun_ostatni y z k4 k5)
   deleted: (clear k5) (on-floor k4) (krazek-na-paliku k4 y)
   added: (on-top k4 k5) (krazek-na-paliku k4 z) (pusty y)
   goals met: 2 of 5
25. (przesun x z k1 k2 k4)
   deleted: (clear k4) (on-top k1 k2) (krazek-na-paliku k1 x)
   added: (on-top k1 k4) (clear k2) (krazek-na-paliku k1 z)
   goals met: 3 of 5
26. (przesun-na-pusty x y k2 k3)
   deleted: (krazek-na-paliku k2 x) (on-top k2 k3) (pusty y)
   added: (krazek-na-paliku k2 y) (clear k3) (on-floor k2)
   goals met: 3 of 5
27. (przesun z y k1 k4 k2)
   deleted: (clear k2) (on-top k1 k4) (krazek-na-paliku k1 z)
   added: (on-top k1 k2) (clear k4) (krazek-na-paliku k1 y)
   goals met: 2 of 5
28. (przesun_ostatni x z k3 k4)
   deleted: (clear k4) (on-floor k3) (krazek-na-paliku k3 x)
   added: (on-top k3 k4) (krazek-na-paliku k3 z) (pusty x)
   goals met: 3 of 5
29. (przesun-na-pusty y x k1 k2)
   deleted: (krazek-na-paliku k1 y) (on-top k1 k2) (pusty x)
   added: (krazek-na-paliku k1 x) (clear k2) (on-floor k1)
   goals met: 3 of 5
30. (przesun_ostatni y z k2 k3)
   deleted: (clear k3) (on-floor k2) (krazek-na-paliku k2 y)
   added: (on-top k2 k3) (krazek-na-paliku k2 z) (pusty y)
   goals met: 4 of 5
31. (przesun_ostatni x z k1 k2)
   deleted: (clear k2) (on-floor k1) (krazek-na-paliku k1 x)
   added: (on-top k1 k2) (krazek-na-paliku k1 z) (pusty x)
   goals met: 5 of 5
